//============================================================================================
// Application : BLOCK BREAK PRO-68KZ
// Platform    : SHARP X68000 / Human68k
// Build       : GCC真里子版(ver1.42) + XCライブラリ + Z-MUSIC(v2.00)
//--------------------------------------------------------------------------------------------
// Filename    : block.h
// Version     : 2.0.0
// Author      : SEN::DAC
// Description : ゲームオブジェクト[ブロック]の処理
//============================================================================================
//--------------------------------------------------------------------------------------------
// 2重インクルード防止
//--------------------------------------------------------------------------------------------
#ifndef _BLOCK_H_
#define _BLOCK_H_

//--------------------------------------------------------------------------------------------
// インクルードファイル
//--------------------------------------------------------------------------------------------
#include "../StdAfx.h"

//--------------------------------------------------------------------------------------------
// 定数定義
//--------------------------------------------------------------------------------------------
// ブロック1つのサイズ
#define BLOCK_WIDTH             32 // 横幅:BG(16)を横に2個     16 * 2 = 32
#define BLOCK_HEIGHT            8  // 縦幅:BG(16)の中に上下2つ 16 / 2 = 8

// ブロックデータの構造
#define BLOCK_DATA_EL_W         6  // 横の要素数  6 * 2 = 12個のBG → X
#define BLOCK_DATA_EL_H         16 // 縦の要素数 16 / 2 =  8個のBG → Y
#define BLOCK_DATA_EL_MAX       (BLOCK_DATA_EL_W * BLOCK_DATA_EL_H) // 6 * 16 = 96

// ブロックデータの意味
#define BLOCK_DATA_NONE         0  // ブロック無し
#define BLOCK_DATA_NORMAL1      1  // 通常ブロック:強度1
#define BLOCK_DATA_NORMAL2      2  // 通常ブロック:強度2
#define BLOCK_DATA_NORMAL3      3  // 通常ブロック:強度3
#define BLOCK_DATA_BORDER       4  // --- 通常ブロックとアイテムブロックの境界 ---
#define BLOCK_DATA_ITEM_BALL    4  // アイテムブロック:ボール
#define BLOCK_DATA_ITEM_RACKET  5  // アイテムブロック:ラケット
#define BLOCK_DATA_ITEM_THROUGH 6  // アイテムブロック:貫通
#define BLOCK_DATA_ITEM_SHOT    7  // アイテムブロック:ショット
#define BLOCK_DATA_TYPE_MAX     8  // ブロックデータの種類数

// ブロックと他のオブジェクトとの当たり判定用オフセット値
#define BLOCK_HIT_OFFSET_X      2 // 当たり判定を,ブロック(W32)"2"個分(64dot)左へずらす(-2)
#define BLOCK_HIT_OFFSET_Y      4 // 当たり判定を,ブロック(H 8)"4"個分(32dot)上へずらす(-4)

//--------------------------------------------------------------------------------------------
// 型定義
//--------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------
// extern
//--------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------
// プロトタイプ宣言
//--------------------------------------------------------------------------------------------
BL blf_g_ObjBlockLoadImage(VD);                         // ブロックの画像とパレットをロード
VD vdf_g_ObjBlockInit(U1 stage);                        // 初期化
VD vdf_g_ObjBlockRun(VD);                               // 実行 (未使用)
VD vdf_g_ObjBlockDraw(VD);                              // 描画 (未使用)
VD vdf_g_ObjBlockRelease(VD);                           // 解放

U1 u1f_g_ObjBlockGetData(U2 u2_x, U2 u2_y);             // 対象箇所のブロックデータを返す
VD vdf_g_ObjBlockSetData(U2 u2_x, U2 u2_y, U1 u1_data); // 指定箇所のブロックデータを書き込む
VD vdf_g_ObjBlockBgUpdate(U2 u2_x, U2 u2_y);            // 対象箇所のブロック(BG)表示更新
BL blf_g_ObjBlockIsAllNone(VD);                         // クリア判定 (ブロックを全て崩したか？)
VD vdf_g_ObjBlockAllClear(VD);                          // ブロックデータと表示を全クリア(未使用)

#endif // _BLOCK_H_
