//============================================================================================
// Application : BLOCK BREAK PRO-68KZ
// Platform    : SHARP X68000 / Human68k
// Build       : GCC真里子版(ver1.42) + XCライブラリ + Z-MUSIC(v2.00)
//--------------------------------------------------------------------------------------------
// Filename    : block.c
// Version     : 2.0.0
// Author      : SEN::DAC
// Description : ゲームオブジェクト[ブロック]の処理
//               プログラムの構造上、厳密には異なるが便宜上オブジェクトとして分類する
//               SPのプレーン数が足りないため、BGを使って描画を行っている
//============================================================================================
//--------------------------------------------------------------------------------------------
// インクルードファイル
//--------------------------------------------------------------------------------------------
#include "block.h"

//--------------------------------------------------------------------------------------------
// 定数定義 (内部用)
//--------------------------------------------------------------------------------------------
// 読み込むBMP画像ファイルの数
#define BLOCK_BMP_FILE_NUM (8 * 8)

// ブロックをBGで描画する際の要素数
#define BLOCK_BG_EL_W (BLOCK_DATA_EL_W * 2) // 1つのブロックの幅はBG2つ分のため
#define BLOCK_BG_EL_H (BLOCK_DATA_EL_H / 2) // 1つのBGが縦に2つのブロックを持つため

// ブロックをBGで描画する際のオフセット値
// 1個のブロックの横幅が32(W16のBGを2つ使う)ブロック"2"分個右へ(2 * 2 = 4)
#define BLOCK_X_OFFSET 4
// 1個のブロックの縦幅が 8(H16のBGを1/2使う)ブロック"4"分個下へ(4 / 2 = 2)
#define BLOCK_Y_OFFSET 2

//--------------------------------------------------------------------------------------------
// 型定義 (内部用)
//--------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------
// プロトタイプ宣言 (static)
//--------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------
// グローバル変数定義 (外部公開)
//--------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------
// 静的変数定義 (static)
//--------------------------------------------------------------------------------------------
// ブロック画像のファイル名テーブル
//
// PCG書込み後のアクセス方法：
// ブロックのPCG番号先頭 + (上のブロック種類番号 * ブロック種類数) + 下のブロック種類番号
static const char* const szacpc_s_BlockImgFileNameTbl[BLOCK_BMP_FILE_NUM] =
{
    SZ_IMGFN_BLOCK_00,  // 上：0(空) / 下：0(空) [00]
    SZ_IMGFN_BLOCK_01,  // 上：0(空) / 下：1(白) [01]
    SZ_IMGFN_BLOCK_02,  // 上：0(空) / 下：2(灰) [02]
    SZ_IMGFN_BLOCK_03,  // 上：0(空) / 下：3(黒) [03]
    SZ_IMGFN_BLOCK_04,  // 上：0(空) / 下：4(赤) [04]
    SZ_IMGFN_BLOCK_05,  // 上：0(空) / 下：5(緑) [05]
    SZ_IMGFN_BLOCK_06,  // 上：0(空) / 下：6(青) [06]
    SZ_IMGFN_BLOCK_07,  // 上：0(空) / 下：7(黄) [07]

    SZ_IMGFN_BLOCK_10,  // 上：1(白) / 下：0(空) [08]
    SZ_IMGFN_BLOCK_11,  // 上：1(白) / 下：1(白) [09]
    SZ_IMGFN_BLOCK_12,  // 上：1(白) / 下：2(灰) [10]
    SZ_IMGFN_BLOCK_13,  // 上：1(白) / 下：3(黒) [11]
    SZ_IMGFN_BLOCK_14,  // 上：1(白) / 下：4(赤) [12]
    SZ_IMGFN_BLOCK_15,  // 上：1(白) / 下：5(緑) [13]
    SZ_IMGFN_BLOCK_16,  // 上：1(白) / 下：6(青) [14]
    SZ_IMGFN_BLOCK_17,  // 上：1(白) / 下：7(黄) [15]

    SZ_IMGFN_BLOCK_20,  // 上：2(灰) / 下：0(空) [16]
    SZ_IMGFN_BLOCK_21,  // 上：2(灰) / 下：1(白) [17]
    SZ_IMGFN_BLOCK_22,  // 上：2(灰) / 下：2(灰) [18]
    SZ_IMGFN_BLOCK_23,  // 上：2(灰) / 下：3(黒) [19]
    SZ_IMGFN_BLOCK_24,  // 上：2(灰) / 下：4(赤) [20]
    SZ_IMGFN_BLOCK_25,  // 上：2(灰) / 下：5(緑) [21]
    SZ_IMGFN_BLOCK_26,  // 上：2(灰) / 下：6(青) [22]
    SZ_IMGFN_BLOCK_27,  // 上：2(灰) / 下：7(黄) [23]

    SZ_IMGFN_BLOCK_30,  // 上：3(黒) / 下：0(空) [24]
    SZ_IMGFN_BLOCK_31,  // 上：3(黒) / 下：1(白) [25]
    SZ_IMGFN_BLOCK_32,  // 上：3(黒) / 下：2(灰) [26]
    SZ_IMGFN_BLOCK_33,  // 上：3(黒) / 下：3(黒) [27]
    SZ_IMGFN_BLOCK_34,  // 上：3(黒) / 下：4(赤) [28]
    SZ_IMGFN_BLOCK_35,  // 上：3(黒) / 下：5(緑) [29]
    SZ_IMGFN_BLOCK_36,  // 上：3(黒) / 下：6(青) [30]
    SZ_IMGFN_BLOCK_37,  // 上：3(黒) / 下：7(黄) [31]

    SZ_IMGFN_BLOCK_40,  // 上：4(赤) / 下：0(空) [32]
    SZ_IMGFN_BLOCK_41,  // 上：4(赤) / 下：1(白) [33]
    SZ_IMGFN_BLOCK_42,  // 上：4(赤) / 下：2(灰) [34]
    SZ_IMGFN_BLOCK_43,  // 上：4(赤) / 下：3(黒) [35]
    SZ_IMGFN_BLOCK_44,  // 上：4(赤) / 下：4(赤) [36]
    SZ_IMGFN_BLOCK_45,  // 上：4(赤) / 下：5(緑) [37]
    SZ_IMGFN_BLOCK_46,  // 上：4(赤) / 下：6(青) [38]
    SZ_IMGFN_BLOCK_47,  // 上：4(赤) / 下：7(黄) [39]

    SZ_IMGFN_BLOCK_50,  // 上：5(緑) / 下：0(空) [40]
    SZ_IMGFN_BLOCK_51,  // 上：5(緑) / 下：1(白) [41]
    SZ_IMGFN_BLOCK_52,  // 上：5(緑) / 下：2(灰) [42]
    SZ_IMGFN_BLOCK_53,  // 上：5(緑) / 下：3(黒) [43]
    SZ_IMGFN_BLOCK_54,  // 上：5(緑) / 下：4(赤) [44]
    SZ_IMGFN_BLOCK_55,  // 上：5(緑) / 下：5(緑) [45]
    SZ_IMGFN_BLOCK_56,  // 上：5(緑) / 下：6(青) [46]
    SZ_IMGFN_BLOCK_57,  // 上：5(緑) / 下：7(黄) [47]

    SZ_IMGFN_BLOCK_60,  // 上：6(青) / 下：0(空) [48]
    SZ_IMGFN_BLOCK_61,  // 上：6(青) / 下：1(白) [49]
    SZ_IMGFN_BLOCK_62,  // 上：6(青) / 下：2(灰) [50]
    SZ_IMGFN_BLOCK_63,  // 上：6(青) / 下：3(黒) [51]
    SZ_IMGFN_BLOCK_64,  // 上：6(青) / 下：4(赤) [52]
    SZ_IMGFN_BLOCK_65,  // 上：6(青) / 下：5(緑) [53]
    SZ_IMGFN_BLOCK_66,  // 上：6(青) / 下：6(青) [54]
    SZ_IMGFN_BLOCK_67,  // 上：6(青) / 下：7(黄) [55]

    SZ_IMGFN_BLOCK_70,  // 上：7(黄) / 下：0(空) [56]
    SZ_IMGFN_BLOCK_71,  // 上：7(黄) / 下：1(白) [57]
    SZ_IMGFN_BLOCK_72,  // 上：7(黄) / 下：2(灰) [58]
    SZ_IMGFN_BLOCK_73,  // 上：7(黄) / 下：3(黒) [59]
    SZ_IMGFN_BLOCK_74,  // 上：7(黄) / 下：4(赤) [60]
    SZ_IMGFN_BLOCK_75,  // 上：7(黄) / 下：5(緑) [61]
    SZ_IMGFN_BLOCK_76,  // 上：7(黄) / 下：6(青) [62]
    SZ_IMGFN_BLOCK_77,  // 上：7(黄) / 下：7(黄) [63]
};

// ブロックデータ(プレイ用)
static U1 u1a_s_ObjBlockData[BLOCK_DATA_EL_MAX];

// ブロックデータ(各ステージの初期値)
// 注：
// アイテムブロック(4～)の配置に注意
// スプライトプレーン節約の影響で同時に生成できるアイテム数に制約がある。
// しかし、通常プレイで問題が起きる可能性はほぼ無い。
// (詳細はsrc\object\item.hを参照)
static const U1 u1aac_s_ObjBlockDefData[STAGE_MAX][BLOCK_DATA_EL_MAX] =
{
/*
    // 当たり判定テスト用 全て硬ブロック
    {
        3,3,3,3,3,3,
        3,3,3,3,3,3,
        3,3,3,3,3,3,
        3,3,3,3,3,3,
        3,3,3,3,3,3,
        3,3,3,3,3,3,
        3,3,3,3,3,3,
        3,3,3,3,3,3,
        3,3,3,3,3,3,
        3,3,3,3,3,3,
        3,3,3,3,3,3,
        3,3,3,3,3,3,
        3,3,3,3,3,3,
        3,3,3,3,3,3,
        3,3,3,3,3,3,
        3,3,3,3,3,3,
    },*/
    // Stage.1 ブロック配置データ
    {
        4,5,6,7,4,5,
        4,5,6,7,4,5,
        4,5,6,7,4,5,
        4,5,6,7,4,5,
        4,5,6,7,4,5,
        4,5,6,7,4,5,
        4,5,6,7,4,5,
        4,5,6,7,4,5,
        4,5,6,7,4,5,
        4,5,6,7,4,5,
        4,5,6,7,4,5,
        4,5,6,7,4,5,
        4,5,6,7,4,5,
        4,5,6,7,4,5,
        4,5,6,7,4,5,
        4,5,6,7,4,5,
    },
    // Stage.2 ブロック配置データ
    {
        1,1,1,1,1,1,
        2,2,2,2,2,2,
        3,3,3,3,3,3,
        4,4,4,4,4,4,
        5,5,5,5,5,5,
        6,6,6,6,6,6,
        7,7,7,7,7,7,
        0,0,0,0,0,0,
        0,0,0,0,0,0,
        1,1,1,1,1,1,
        2,2,2,2,2,2,
        3,3,3,3,3,3,
        4,4,4,4,4,4,
        5,5,5,5,5,5,
        6,6,6,6,6,6,
        7,7,7,7,7,7,
    },
    // Stage.3 ブロック配置データ
    {
        5,4,7,7,7,7,
        7,4,7,7,3,7,
        5,4,7,7,3,6,
        7,4,7,7,3,6,
        5,4,7,7,3,6,
        7,4,6,3,3,6,
        4,7,6,3,3,6,
        4,7,6,4,3,6,
        4,7,6,3,3,6,
        4,7,3,3,7,6,
        4,7,3,3,7,7,
        4,7,3,3,7,7,
        4,7,3,3,7,5,
        4,7,3,3,7,0,
        4,4,3,3,5,0,
        4,4,7,5,4,0,
    },
    // Stage.4 ブロック配置データ
    {
        4,3,3,3,3,4,
        4,4,7,5,7,4,
        4,7,4,4,6,4,
        4,4,7,5,7,4,
        4,7,4,4,6,4,
        4,4,7,5,7,4,
        4,7,6,6,6,4,
        4,4,6,6,7,4,
        4,7,4,4,6,4,
        4,4,7,5,7,4,
        3,7,4,4,6,3,
        3,4,7,5,7,3,
        3,7,4,4,6,3,
        3,3,3,3,3,3,
    },
    // Stage.5 ブロック配置データ
    {
        4,4,2,2,5,5,
        4,4,2,2,5,5,
        4,4,2,2,5,5,
        4,4,2,2,5,5,
        4,4,2,2,5,5,
        4,4,2,2,5,5,
        4,4,2,2,5,5,
        2,2,3,3,2,2,
        2,2,3,3,2,2,
        6,6,2,2,7,7,
        6,6,2,2,7,7,
        6,6,2,2,7,7,
        6,6,2,2,7,7,
        6,6,2,2,7,7,
        6,6,2,2,7,7,
        6,6,2,2,7,7,
    },
};

//--------------------------------------------------------------------------------------------
// 関数定義
//--------------------------------------------------------------------------------------------
//============================================================================================
// ゲームオブジェクト[ブロック]の画像とパレットをロード
//--------------------------------------------------------------------------------------------
// Arguments : -
// Return    : BL : (O) TRUE  : 成功
//                      FALSE : 失敗
//============================================================================================
BL blf_g_ObjBlockLoadImage(VD)
{
    S4  s4_i;
    U4  u4a_pcg[PCG_TILE_SIZE_32U4];                     // BMP → PCG変換用
    U2  u2a_pal[DR_COL16];                               // 16色パレット登録用
    U1* const u1cp_bbuf = u1cpf_g_DrGetBmpBuf();         // BMPロード用バッファ取得

    for(s4_i = 0; s4_i < BLOCK_BMP_FILE_NUM; s4_i++)     // 全てのブロック画像ファイル
    {
        // 16色BMP画像ロードと書込み
        if(!blf_g_DrLoadBmp16(szacpc_s_BlockImgFileNameTbl[s4_i], u1cp_bbuf)) return FALSE;

        vdf_g_SpBmpToPcg(u4a_pcg, (U4*)u1cp_bbuf);       // BMP → PCG 変換
        SP_DEFCG(s4_i, SP_SIZE16, (U1*)u4a_pcg);         // PCGに画像転送
    }
    vdf_g_AppPBarAdd();                                  // プログレスバーを進める

    // ブロック(BG)の16色パレットをロード(GR以外は登録をここで行っても良い)
    if(!blf_g_DrLoadPal16(szacpc_s_BlockImgFileNameTbl[0], u2a_pal, BRIGHT_OFF)) return FALSE;

    vdf_g_DrSetPal16(DR_PAL_PCG, PB_PCG_BLOCK, u2a_pal); // 登録
    vdf_g_AppPBarAdd();                                  // プログレスバーを進める

    return TRUE;
}

//============================================================================================
// ゲームオブジェクト[ブロック]の初期化処理
//--------------------------------------------------------------------------------------------
// Arguments : U1 u1_stage : (I) 現在のステージ (ここで指定したステージのブロックデータになる)
// Return    : -
//============================================================================================
VD vdf_g_ObjBlockInit(U1 u1_stage)
{
    S4 s4_i, s4_x, s4_y;
    U1 u1_top;           // BG表示：上段ブロックデータ
    U1 u1_btm;           // BG表示：下段ブロックデータ
    U1 u1_pcg;           // PCG番号
    U2 u2_ptc;           // パターンコード

    if(u1_stage < STAGE_MAX)
    {
        // ブロックデータ初期化
        for(s4_i = 0; s4_i < BLOCK_DATA_EL_MAX; s4_i ++)
        {
            u1a_s_ObjBlockData[s4_i] = u1aac_s_ObjBlockDefData[u1_stage][s4_i];
        }

        // BG初期化(表示)
        // ブロック1つの大きさW:32,H:8に対して、BGは16*16サイズ(個別座標変更不可グリッド固定)
        // ブロック種別は"0:なし"を含めて0-7の計8種類がある
        // 上段ブロック(8種) * 下段ブロック(8種) = 64種類の画像(PCG)が存在する。
        for(s4_y = 0; s4_y < BLOCK_BG_EL_H; s4_y ++){
            for(s4_x = 0; s4_x < BLOCK_BG_EL_W; s4_x += 2){

                // y * 2 にて、y方向は縦2段毎のアクセスを行う
                // x / 2 にて、x方向は 0.1.2.3... と順にアクセスする
                u1_top = // 上段(基準)
                u1a_s_ObjBlockData[(s4_y * 2 + 0) * BLOCK_DATA_EL_W + (s4_x / 2)];
                u1_btm = // 下段(y + 1)
                u1a_s_ObjBlockData[(s4_y * 2 + 1) * BLOCK_DATA_EL_W + (s4_x / 2)];

                // PCG番号算出(構造についてはszacpc_s_BlockImgFileNameTblを参照)
                u1_pcg = PCG_BLOCK_TOP + (u1_top * BLOCK_DATA_TYPE_MAX + u1_btm);

                // ブロック左
                u2_ptc = u2f_g_SpMkPtc(SP_V_INV_OFF, SP_H_INV_OFF, PB_PCG_BLOCK, u1_pcg);
                vdf_g_SpBgSet(SP_BG_AR1,
                              s4_x + BLOCK_X_OFFSET + 0,
                              s4_y + BLOCK_Y_OFFSET,
                              u2_ptc);

                // ブロック右：1つ右側のマスにH-水平反転で表示
                u2_ptc = u2f_g_SpMkPtc(SP_V_INV_OFF, SP_H_INV_ON, PB_PCG_BLOCK, u1_pcg);
                vdf_g_SpBgSet(SP_BG_AR1,
                              s4_x + BLOCK_X_OFFSET + 1,
                              s4_y + BLOCK_Y_OFFSET,
                              u2_ptc);
            }
        }
        vdf_g_SpBg0dispOn(); // BG0表示 ON
    }
}

//============================================================================================
// ゲームオブジェクト[ブロック]の実行処理
//--------------------------------------------------------------------------------------------
// Arguments : -
// Return    : -
//--------------------------------------------------------------------------------------------
// Note      :
// 他のオブジェクトと構造を合わせるために存在 (今後の拡張用)
//============================================================================================
VD vdf_g_ObjBlockRun(VD)
{
    // NOP
}

//============================================================================================
// ゲームオブジェクト[ブロック]の描画処理
//--------------------------------------------------------------------------------------------
// Arguments : -
// Return    : -
//--------------------------------------------------------------------------------------------
// Note      :
// 他のオブジェクトと構造を合わせるために存在 (今後の拡張用)
//============================================================================================
VD vdf_g_ObjBlockDraw(VD)
{
    // NOP
}

//============================================================================================
// ゲームオブジェクト[ブロック]の解放処理
//--------------------------------------------------------------------------------------------
// Arguments : -
// Return    : -
//============================================================================================
VD vdf_g_ObjBlockRelease(VD)
{
    vdf_g_SpBg0dispOff(); // BG0表示 OFF
}

//============================================================================================
// 指定箇所のブロックデータを返す
//--------------------------------------------------------------------------------------------
// Arguments : U2 u2_x : (I) 取得対象ブロックデータのX要素番号
//             U2 u2_y : (I) 取得対象ブロックデータのY要素番号
// Return    : U1      : (O) ブロックデータ
//============================================================================================
U1 u1f_g_ObjBlockGetData(U2 u2_x, U2 u2_y)
{
    U1 u1_ret = 0;

    if(u2_x < BLOCK_DATA_EL_W && u2_y < BLOCK_DATA_EL_H)            // 引数は範囲内か？
    {
        u1_ret = u1a_s_ObjBlockData[u2_y * BLOCK_DATA_EL_W + u2_x]; // ブロックデータ取得
    }

    return u1_ret;
}

//============================================================================================
// 指定箇所のブロックデータを書き込む
//--------------------------------------------------------------------------------------------
// Arguments : U2 u2_x    : (I) 設定対象ブロックデータのX要素番号
//             U2 u2_y    : (I) 設定対象ブロックデータのY要素番号
//             U1 u1_data : (I) ブロックデータの設定値
// Return    : -
//============================================================================================
VD vdf_g_ObjBlockSetData(U2 u2_x, U2 u2_y, U1 u1_data)
{
    if(u2_x < BLOCK_DATA_EL_W && u2_y < BLOCK_DATA_EL_H)             // 引数は範囲内か？
    {
        u1a_s_ObjBlockData[u2_y * BLOCK_DATA_EL_W + u2_x] = u1_data; // ブロックデータ書込み
    }
}

//============================================================================================
// 指定箇所のブロック表示(BG)更新 (ブロックデータを基にBGの表示を更新する)
//--------------------------------------------------------------------------------------------
// Arguments : U2 u2_x : (I) BG表示更新対象ブロックデータのX要素番号
//             U2 u2_y : (I) BG表示更新対象ブロックデータのY要素番号
// Return    : -
//============================================================================================
VD vdf_g_ObjBlockBgUpdate(U2 u2_x, U2 u2_y)
{
    U1 u1_top;    // BG表示：上段ブロックデータ
    U1 u1_btm;    // BG表示：下段ブロックデータ
    U1 u1_pcg;    // PCG番号
    U4 u2_ptc;    // パターンコード

    if(u2_x < BLOCK_DATA_EL_W && u2_y < BLOCK_DATA_EL_H)                      // 引数範囲確認
    {
        // u2_yが偶数の場合(BG内上段のブロックが基準)
        if(!(u2_y & 1))
        {
            u1_top = u1a_s_ObjBlockData[(u2_y + 0) * BLOCK_DATA_EL_W + u2_x]; // 上段(基準)
            u1_btm = u1a_s_ObjBlockData[(u2_y + 1) * BLOCK_DATA_EL_W + u2_x]; // 下段(y + 1)

            // PCG番号算出(構造についてはszacpc_s_BlockImgFileNameTblを参照)
            u1_pcg = PCG_BLOCK_TOP + (u1_top * BLOCK_DATA_TYPE_MAX + u1_btm);

            // ブロック左
            u2_ptc = u2f_g_SpMkPtc(SP_V_INV_OFF, SP_H_INV_OFF, PB_PCG_BLOCK, u1_pcg);
            vdf_g_SpBgSet(SP_BG_AR1,
                          (u2_x * 2) + BLOCK_X_OFFSET + 0,
                          (u2_y / 2) + BLOCK_Y_OFFSET,
                          u2_ptc);

            // ブロック右：一つ右側のマスにH反転(u1_h1)表示
            u2_ptc = u2f_g_SpMkPtc(SP_V_INV_OFF, SP_H_INV_ON, PB_PCG_BLOCK, u1_pcg);
            vdf_g_SpBgSet(SP_BG_AR1,
                          (u2_x * 2) + BLOCK_X_OFFSET + 1,
                          (u2_y / 2) + BLOCK_Y_OFFSET,
                          u2_ptc);
        }
        // u2_yが奇数の場合(BG内下段のブロックが基準)
        else
        {
            u1_top = u1a_s_ObjBlockData[(u2_y - 1) * BLOCK_DATA_EL_W + u2_x]; // 上段(y - 1)
            u1_btm = u1a_s_ObjBlockData[(u2_y - 0) * BLOCK_DATA_EL_W + u2_x]; // 下段(基準)

            // PCG番号算出(構造についてはszacpc_s_BlockImgFileNameTblを参照)
            u1_pcg = PCG_BLOCK_TOP + (u1_top * BLOCK_DATA_TYPE_MAX + u1_btm);

            // ブロック左
            u2_ptc = u2f_g_SpMkPtc(SP_V_INV_OFF, SP_H_INV_OFF, PB_PCG_BLOCK, u1_pcg);
            vdf_g_SpBgSet(SP_BG_AR1,
                          (u2_x * 2) + BLOCK_X_OFFSET + 0,
                          ((u2_y - 1) / 2) + BLOCK_Y_OFFSET,
                          u2_ptc);

            // ブロック右：一つ右側のマスにH反転(u1_h1)表示
            u2_ptc = u2f_g_SpMkPtc(SP_V_INV_OFF, SP_H_INV_ON, PB_PCG_BLOCK, u1_pcg);
            vdf_g_SpBgSet(SP_BG_AR1,
                          (u2_x * 2) + BLOCK_X_OFFSET + 1,
                          ((u2_y - 1) / 2) + BLOCK_Y_OFFSET,
                          u2_ptc);
        }
    }
}

//============================================================================================
// ブロックを全て崩したか？ (クリア判定)
//--------------------------------------------------------------------------------------------
// Arguments : -
// Return    : BL bl_ret : (O) TRUE  : ブロックを全て崩した
//                             FALSE : ブロックはまだある
//============================================================================================
BL blf_g_ObjBlockIsAllNone(VD)
{
    S4 s4_i;
    BL bl_ret = TRUE;                                // 戻り値格納用

    for(s4_i = 0; s4_i < BLOCK_DATA_EL_MAX; s4_i ++) // 全てのブロックの中に
    {
        if(u1a_s_ObjBlockData[s4_i])                 // まだ消えていないブロックがあるなら
        {
            bl_ret = FALSE;                          // クリアではない
            break;                                   // 1つでもあれば確定なのでループ終了
        }
    }

    return bl_ret;
}

//============================================================================================
// ブロックデータと表示を全クリア
//--------------------------------------------------------------------------------------------
// Arguments : -
// Return    : -
//============================================================================================
VD vdf_g_ObjBlockAllClear(VD)
{
    S4 s4_i, s4_x, s4_y;

    // ブロックデータ全クリア
    for(s4_i = 0; s4_i < BLOCK_DATA_EL_MAX; s4_i ++)
    {
        u1a_s_ObjBlockData[s4_i] = BLOCK_DATA_NONE;
    }

    // BG表示を全て消す
    for(s4_y = 0; s4_y < BLOCK_BG_EL_H; s4_y ++){
        for(s4_x = 0; s4_x < BLOCK_BG_EL_W; s4_x += 2){
            vdf_g_SpBgSet(SP_BG_AR1, s4_x + BLOCK_X_OFFSET + 0, s4_y + BLOCK_Y_OFFSET, SP_PRW_HIDE);
            vdf_g_SpBgSet(SP_BG_AR1, s4_x + BLOCK_X_OFFSET + 1, s4_y + BLOCK_Y_OFFSET, SP_PRW_HIDE);
        }
    }
}
