//============================================================================================
// Application : BLOCK BREAK PRO-68KZ
// Platform    : SHARP X68000 / Human68k
// Build       : GCC真里子版(ver1.42) + XCライブラリ + Z-MUSIC(v2.00)
//--------------------------------------------------------------------------------------------
// Filename    : item.c
// Version     : 2.0.0
// Author      : SEN::DAC
// Description : ゲームオブジェクト[アイテム]の処理
//============================================================================================
//--------------------------------------------------------------------------------------------
// インクルードファイル
//--------------------------------------------------------------------------------------------
#include "item.h"

//--------------------------------------------------------------------------------------------
// 定数定義 (内部用)
//--------------------------------------------------------------------------------------------
#define ITEM_DEF_MY 1               // アイテム落下速度(移動はY+方向のみ)

// アイテム最大数
// 理論上はブロックデータ要素数と同じ数だけ同時に実行(表示)できるアイテム数が必要。
// しかし、スプライトプレーンの枚数にはハードウェアの上限がある。
// 実際、全てのブロックが同時にアイテムを生成する可能性は極めて低い。
// このためブロックデータ要素数(BLOCK_DATA_EL_MAX)から数個分を引いてアイテム最大個数とする。
#define ITEM_SHRINK     10                                // 節約数
#define ITEM_MAX        (BLOCK_DATA_EL_MAX - ITEM_SHRINK) // アイテム最大数

// アイテム種別(ステータス)
#define ITEM_ST_BALL    0           // アイテム種別：ボール
#define ITEM_ST_RACKET  1           // アイテム種別：ラケット
#define ITEM_ST_THROUGH 2           // アイテム種別：貫通
#define ITEM_ST_SHOT    3           // アイテム種別：ショット
#define ITEM_ST_NON     4           // アイテム種別：未使用(なし)
#define ITEM_ST_MAX     ITEM_ST_NON // アイテム種別の個数

//--------------------------------------------------------------------------------------------
// 型定義 (内部用)
//--------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------
// プロトタイプ宣言 (static)
//--------------------------------------------------------------------------------------------
// オブジェクトと当たり判定
static BL blf_s_ObjItemHitObj(S4 s4_id, const stOBJECT* const stcpc_obj);

// アイテム削除
static VD vdf_s_ObjItemDelete(S4 s4_id);

//--------------------------------------------------------------------------------------------
// グローバル変数定義 (外部公開)
//--------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------
// 静的変数定義 (static)
//--------------------------------------------------------------------------------------------
// アイテム画像のファイル名テーブル
static const char* const szacpc_s_ItemImgFileNameTbl[ITEM_ST_MAX] =
{
    SZ_IMGFN_ITEM_B,
    SZ_IMGFN_ITEM_R,
    SZ_IMGFN_ITEM_T,
    SZ_IMGFN_ITEM_S,
};

// アイテム効果の関数テーブル
// 安全のためconst付与しているが、誤って異なる関数を代入しても
// 警告のみでエラーは出ないため注意すること。
static VD (* const vdfpac_s_ObjItemExec[])(VD) = {
    vdf_g_ObjBallAdd,        // ボールの追加
    vdf_g_ObjRacketLvUp,     // ラケットレベル-アップ
    vdf_g_ObjBallSetThrough, // ボール貫通
    vdf_g_ObjShotAdd         // ショットの追加
};

// オブジェクト
static stOBJECT sta_s_ObjItem[ITEM_MAX];

// ステータス(未使用/アイテム種類)
// オブジェクト毎の用途の違いから演算相手の符号の有無が異なる。
// このため、堅牢性を優先しオブジェクト構造体のメンバに含めず別で持つ方針とした。
static U1 u1a_s_ObjItemStatus[ITEM_MAX];

//--------------------------------------------------------------------------------------------
// 関数定義
//--------------------------------------------------------------------------------------------
//============================================================================================
// ゲームオブジェクト[アイテム]の画像とパレットをロード
//--------------------------------------------------------------------------------------------
// Arguments : -
// Return    : BL : (O) TRUE  : 成功
//                      FALSE : 失敗
//============================================================================================
BL blf_g_ObjItemLoadImage(VD)
{
    S4  s4_i;
    U4  u4a_pcg[PCG_TILE_SIZE_32U4];                            // BMP → PCG変換用
    U2  u2a_pal[DR_COL16];                                      // 16色パレット登録用
    U1* const u1cp_bbuf = u1cpf_g_DrGetBmpBuf();                // BMPロード用バッファ取得

    // 16色BMP画像ロードと書込み
    for(s4_i = 0; s4_i < ITEM_ST_MAX; s4_i ++)
    {
        if(!blf_g_DrLoadBmp16(szacpc_s_ItemImgFileNameTbl[s4_i], u1cp_bbuf)) return FALSE;

        vdf_g_SpBmpToPcg(u4a_pcg, (U4*)u1cp_bbuf);              // BMP → PCG 変換
        SP_DEFCG(PCG_ITEM_TOP + s4_i, SP_SIZE16, (U1*)u4a_pcg); // PCGに画像転送
    }
    vdf_g_AppPBarAdd();                                         // プログレスバーを進める

    // アイテム(SP)のパレットのロード(GR以外は登録をここで行っても良い)
    if(!blf_g_DrLoadPal16(szacpc_s_ItemImgFileNameTbl[0], u2a_pal, BRIGHT_OFF)) return FALSE;

    vdf_g_DrSetPal16(DR_PAL_PCG, PB_PCG_ITEM, u2a_pal);         // 登録
    vdf_g_AppPBarAdd();                                         // プログレスバーを進める

    return TRUE;
}

//============================================================================================
// ゲームオブジェクト[アイテム]の初期化処理
//--------------------------------------------------------------------------------------------
// Arguments : -
// Return    : -
//============================================================================================
VD vdf_g_ObjItemInit(VD)
{
    S4 s4_i;

    for(s4_i = 0; s4_i < ITEM_MAX; s4_i ++)              // 全てのアイテム
    {
        sta_s_ObjItem[s4_i].s2_x  = 0;                   // X座標(アイテム生成時に設定)
        sta_s_ObjItem[s4_i].s2_y  = 0;                   // Y座標(アイテム生成時に設定)
        sta_s_ObjItem[s4_i].s2_mx = 0;                   // X移動量
        sta_s_ObjItem[s4_i].s2_my = ITEM_DEF_MY;         // Y移動量
        sta_s_ObjItem[s4_i].u2_w  = ITEM_WIDTH;          // 横幅
        sta_s_ObjItem[s4_i].u2_h  = ITEM_HEIGHT;         // 縦幅
        u1a_s_ObjItemStatus[s4_i] = ITEM_ST_NON;         // アイテムステータス:なし
    }
}

//============================================================================================
// ゲームオブジェクト[アイテム]の実行処理
//--------------------------------------------------------------------------------------------
// Arguments : -
// Return    : -
//============================================================================================
VD vdf_g_ObjItemRun(VD)
{
    S4 s4_i;

    for(s4_i = 0; s4_i < ITEM_MAX; s4_i ++)                           // 全てのアイテム
    {
        if(u1a_s_ObjItemStatus[s4_i] < ITEM_ST_NON)                   // ステータス[未使用]未満
        {
            sta_s_ObjItem[s4_i].s2_y += sta_s_ObjItem[s4_i].s2_my;    // 移動(下に落ちる)

            // 各関数に渡す引数(s4_i)がsta_s_ObjItem[]に対して有効なインデックスであることは
            // 呼び出し元であるここで保証する方針とする。

            if(sta_s_ObjItem[s4_i].s2_y > FIELD_HEIGHT)               // 画面外に落ちた場合
            {
                vdf_s_ObjItemDelete(s4_i);                            // アイテム削除
            }

            if(blf_s_ObjItemHitObj(s4_i, stcpcf_g_ObjRacketGetObj())) // ラケット当たった場合
            {
                (*vdfpac_s_ObjItemExec[u1a_s_ObjItemStatus[s4_i]])(); // アイテム効果発動
                vdf_g_ObjScoreAdd(SCORE_ADD_HIT_ITEM);                // スコア加算
                vdf_s_ObjItemDelete(s4_i);                            // アイテム削除
            }
        }
    }
}

//============================================================================================
// ゲームオブジェクト[アイテム]の描画処理
//--------------------------------------------------------------------------------------------
// Arguments : -
// Return    : -
//============================================================================================
VD vdf_g_ObjItemDraw(VD)
{
    S4 s4_i;

    for(s4_i = 0; s4_i < ITEM_MAX; s4_i ++)                         // 全てのアイテム
    {
        if(u1a_s_ObjItemStatus[s4_i] < ITEM_ST_NON)                // ステータス[未使用]未満
        {
            vdf_g_SpRegst(SPPL_ITEM_TOP + s4_i,                     // プレーン番号
                          sta_s_ObjItem[s4_i].s2_x,                 // X座標
                          sta_s_ObjItem[s4_i].s2_y,                 // Y座標
                          SP_V_INV_OFF,                             // V-垂直反転
                          SP_H_INV_OFF,                             // H-水平反転
                          PB_PCG_ITEM,                              // パレットブロック番号
                          PCG_ITEM_TOP + u1a_s_ObjItemStatus[s4_i], // PCG番号
                          SP_PRW_SP_BG0_BG1);                       // 描画優先度
        }
    }
}

//============================================================================================
// ゲームオブジェクト[アイテム]の解放処理
//--------------------------------------------------------------------------------------------
// Arguments : -
// Return    : -
//============================================================================================
VD vdf_g_ObjItemRelease(VD)
{
    S4 s4_i;

    for(s4_i = 0; s4_i < ITEM_MAX; s4_i ++) // アイテムのスプライトを全消し
    {
        vdf_g_SpHide(SPPL_ITEM_TOP + s4_i);
    }
}

//============================================================================================
// アイテムの生成
//--------------------------------------------------------------------------------------------
// Arguments : S2 s2_x    : (I) 生成するアイテムのX座標
//             S2 s2_y    ; (I) 生成するアイテムのY座標
//             U1 u1_type : (I) 生成するアイテムの種類
// Return    : BL bl_ret  : (O) TRUE  : 成功
//                              FALSE : 失敗
//============================================================================================
BL blf_g_ObjItemCreate(S2 s2_x, S2 s2_y, U1 u1_type)
{
    S4 s4_i;
    BL bl_ret = FALSE;                                   // 戻り値格納用

    if(u1_type < ITEM_ST_MAX)                            // 種別が設定可能範囲か
    {
        for(s4_i = 0; s4_i < ITEM_MAX; s4_i ++)          // 全てのアイテムから
        {
            if(u1a_s_ObjItemStatus[s4_i] == ITEM_ST_NON) // ステータス[未使用]発見
            {
                sta_s_ObjItem[s4_i].s2_x  = s2_x;        // X座標
                sta_s_ObjItem[s4_i].s2_y  = s2_y;        // Y座標
                u1a_s_ObjItemStatus[s4_i] = u1_type;     // ステータス[アイテム種類]
                bl_ret = TRUE;
                break;
            }
        }
    }

    return bl_ret;
}

//============================================================================================
// アイテムとオブジェクト(現状はラケットのみ)の当たり判定
//--------------------------------------------------------------------------------------------
// Arguments : S4                    s4_id     : (I) 対象アイテムのID
//             const stOBJECT* const stcpc_obj : (I) 相手オブジェクトのポインタ
// Return    : BL                    bl_ret    : (O) TRUE  : 当たっている
//                                                   FALSE : 当たっていない
//--------------------------------------------------------------------------------------------
// Note      :
// 引数(s4_id)については、ループカウンタである事を前提としてガード処理を行わない方針とする。
// for(s4_i = 0; s4_i < ITEM_MAX; s4_i ++){...}
// sta_s_ObjItem[s4_id]が有効なインデックスである事は呼び出し元で保証すること。
//============================================================================================
static BL blf_s_ObjItemHitObj(S4 s4_id, const stOBJECT* const stcpc_obj)
{
    BL bl_ret = FALSE;                                                      // 戻り値格納用

    // 相手オブジェクト側
    S2 s2_o_left   = stcpc_obj->s2_x;                                       // 左辺X座標
    S2 s2_o_top    = stcpc_obj->s2_y;                                       // 上辺Y座標
    S2 s2_o_right  = stcpc_obj->s2_x + stcpc_obj->u2_w;                     // 右辺X座標
    S2 s2_o_bottom = stcpc_obj->s2_y + stcpc_obj->u2_h;                     // 下辺Y座標

    // アイテム側
    S2 s2_b_left   = sta_s_ObjItem[s4_id].s2_x;                             // 左辺X座標
    S2 s2_b_top    = sta_s_ObjItem[s4_id].s2_y;                             // 上辺Y座標
    S2 s2_b_right  = sta_s_ObjItem[s4_id].s2_x + sta_s_ObjItem[s4_id].u2_w; // 右辺X座標
    S2 s2_b_bottom = sta_s_ObjItem[s4_id].s2_y + sta_s_ObjItem[s4_id].u2_h; // 下辺Y座標

    if(s2_o_left <= s2_b_right  && s2_o_right  >= s2_b_left &&              // 当たり判定
       s2_o_top  <= s2_b_bottom && s2_o_bottom >= s2_b_top)
    {
        bl_ret = TRUE;                                                      // 当たっている
    }

    return bl_ret;
}

//============================================================================================
// アイテム削除
//--------------------------------------------------------------------------------------------
// Arguments : S4 s4_id   : (I) 対象アイテムのID
// Return    : -
//--------------------------------------------------------------------------------------------
// Note      :
// 引数(s4_id)については、ループカウンタである事を前提としてガード処理を行わない方針とする。
// for(s4_i = 0; s4_i < ITEM_MAX; s4_i ++){...}
// sta_s_ObjItem[s4_id]が有効なインデックスである事は呼び出し元で保証すること。
//============================================================================================
static VD vdf_s_ObjItemDelete(S4 s4_id)
{
    u1a_s_ObjItemStatus[s4_id] = ITEM_ST_NON; // ステータス[未使用]
    vdf_g_SpHide(SPPL_ITEM_TOP + s4_id);      // 表示を消す
}
