//============================================================================================
// Application : BLOCK BREAK PRO-68KZ
// Platform    : SHARP X68000 / Human68k
// Build       : GCC真里子版(ver1.42) + XCライブラリ + Z-MUSIC(v2.00)
//--------------------------------------------------------------------------------------------
// Filename    : numfont.c
// Version     : 2.0.0
// Author      : SEN::DAC
// Description : オブジェクト[数字フォント]の処理
//============================================================================================
//--------------------------------------------------------------------------------------------
// インクルードファイル
//--------------------------------------------------------------------------------------------
#include "numfont.h"

//--------------------------------------------------------------------------------------------
// 定数定義 (内部用)
//--------------------------------------------------------------------------------------------
#define NFONT_PCG_MAX   10 // PCGの数 (数字 0～9)
#define NFONT_WIDTH     8  // 数字画像1つの横幅
#define DIGIT_BUFF_SIZE 6  // 桁分解バッファの要素数 (表示させたい桁数以上を指定すること)

//--------------------------------------------------------------------------------------------
// 型定義 (内部用)
//--------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------
// プロトタイプ宣言 (static)
//--------------------------------------------------------------------------------------------
VD vdf_g_ObjNumfontDigSep(S4 s4_val, U4* const u4cp_buf, U1 u1_digit); // 桁分離処理

//--------------------------------------------------------------------------------------------
// グローバル変数定義 (外部公開)
//--------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------
// 静的変数定義 (static)
//--------------------------------------------------------------------------------------------
// 数字フォント(0～9)画像のファイル名テーブル
static const char* szacpc_s_NumImgFileNameTbl[NFONT_PCG_MAX] =
{
    SZ_IMGFN_NUMF_0,
    SZ_IMGFN_NUMF_1,
    SZ_IMGFN_NUMF_2,
    SZ_IMGFN_NUMF_3,
    SZ_IMGFN_NUMF_4,
    SZ_IMGFN_NUMF_5,
    SZ_IMGFN_NUMF_6,
    SZ_IMGFN_NUMF_7,
    SZ_IMGFN_NUMF_8,
    SZ_IMGFN_NUMF_9,
};

//--------------------------------------------------------------------------------------------
// 関数定義
//--------------------------------------------------------------------------------------------
//============================================================================================
// ゲームオブジェクト[数字フォント]の画像とパレットをロード
//--------------------------------------------------------------------------------------------
// Arguments : -
// Return    : BL : (O) TRUE  : 成功
//                      FALSE : 失敗
//============================================================================================
BL blf_g_ObjNumfontLoadImage(VD)
{
    S4  s4_i;
    U4  u4a_pcg[PCG_TILE_SIZE_32U4];                              // BMP → PCG変換用
    U2  u2a_pal[DR_COL16];                                        // 16色パレット登録用
    U1* const u1cp_bbuf = u1cpf_g_DrGetBmpBuf();                  // BMPロード用バッファ取得

    // 数字フォント(SP)-16色BMP画像ロードと書込み
    for(s4_i = 0; s4_i < NFONT_PCG_MAX; s4_i++)
    {
        // 16色BMP画像ロードと書込み
        if(!blf_g_DrLoadBmp16(szacpc_s_NumImgFileNameTbl[s4_i], u1cp_bbuf)) return FALSE;
        vdf_g_SpBmpToPcg(u4a_pcg, (U4*)u1cp_bbuf);                // BMP → PCG 変換
        SP_DEFCG(PCG_NUMBER_TOP + s4_i, SP_SIZE16, (U1*)u4a_pcg); // PCGに画像転送
    }
    vdf_g_AppPBarAdd();                                           // プログレスバーを進める

    // 数字フォント(SP)のパレットのロード(GR以外は登録をここで行っても良い)
    if(!blf_g_DrLoadPal16(szacpc_s_NumImgFileNameTbl[0], u2a_pal, BRIGHT_OFF)) return FALSE;

    vdf_g_DrSetPal16(DR_PAL_PCG, PB_PCG_NUMBER, u2a_pal);         // 登録
    vdf_g_AppPBarAdd();                                           // プログレスバーを進める

    return TRUE;
}

//============================================================================================
// ゲームオブジェクト[数字フォント]の初期化処理
//--------------------------------------------------------------------------------------------
// Arguments : -
// Return    : -
//--------------------------------------------------------------------------------------------
// Note      :
// 他のオブジェクトと構造を合わせるために存在 (今後の拡張用)
//============================================================================================
VD vdf_g_ObjNumfontInit(VD)
{
    // NOP
}

//============================================================================================
// ゲームオブジェクト[数字フォント]の実行処理
//--------------------------------------------------------------------------------------------
// Arguments : -
// Return    : -
//--------------------------------------------------------------------------------------------
// Note      :
// 他のオブジェクトと構造を合わせるために存在 (今後の拡張用)
//============================================================================================
VD vdf_g_ObjNumfontRun(VD)
{
    // NOP
}

//============================================================================================
// ゲームオブジェクト[数字フォント]の描画処理
//--------------------------------------------------------------------------------------------
// Arguments : U1 u1_pl    : (I) プレーン番号
//             S2 s2_x     : (I) 表示座標 X
//             S2 s2_y     : (I) 表示座標 Y
//             S4 s4_val   : (I) 描画する値
//             U1 u1_digit : (I) 描画する値の桁数
// Return    : -
//============================================================================================
VD vdf_g_ObjNumfontDraw(U1 u1_pl, S2 s2_x, S2 s2_y, S4 s4_val, U1 u1_digit)
{
    S4 s4_i;
    U4 u4a_dbuf[DIGIT_BUFF_SIZE];                           // 桁分離格納用

    if(u1_digit > 0 && u1_digit <= DIGIT_BUFF_SIZE)         // 桁数が既定範囲内か？
    {
        vdf_g_ObjNumfontDigSep(s4_val, u4a_dbuf, u1_digit); // 本カウントの桁分離

        for(s4_i = 0; s4_i < u1_digit; s4_i ++ )            // カウント表示(上位桁から)
        {
            vdf_g_SpRegst(u1_pl + s4_i,                     // プレーン番号
                          s2_x + (s4_i * NFONT_WIDTH),      // X座標
                          s2_y,                             // Y座標
                          SP_V_INV_OFF,                     // V-垂直反転
                          SP_H_INV_OFF,                     // H-水平反転
                          PB_PCG_NUMBER,                    // パレットブロック番号
                          PCG_NUMBER_TOP + u4a_dbuf[s4_i],  // PCG番号
                          SP_PRW_SP_BG0_BG1);               // 描画優先度
        }
    }
}

//============================================================================================
// ゲームオブジェクト[数字フォント]の解放処理
//--------------------------------------------------------------------------------------------
// Arguments : -
// Return    : -
//--------------------------------------------------------------------------------------------
// Note      :
// 他のオブジェクトと構造を合わせるために存在 (今後の拡張用)
//============================================================================================
VD vdf_g_ObjNumfontRelease(VD)
{
    // NOP
}

//============================================================================================
// 桁分離処理
//--------------------------------------------------------------------------------------------
// Arguments : S4        s4_val   : (I) 桁分解対象の値
//             U4* const u4cp_buf : (O) 出力配列先頭アドレス(要素[0]から上位桁順に格納)
//             U1        u1_digit : (I) 桁数
// Return    : -
//============================================================================================
static VD vdf_g_ObjNumfontDigSep(S4 s4_val, U4* const u4cp_buf, U1 u1_digit)
{
    S4 s4_i;
    S4 s4_filter = 1;                             // フィルタ

    for(s4_i = 0; s4_i < (u1_digit - 1); s4_i ++) // 渡された桁数-1回ループ
    {
        s4_filter *= 10;                          // 渡された桁数の最小値になる
    }                                             // 例：u1_digitが6 → s4_filter = 100000

    for(s4_i = 0; s4_i < u1_digit; s4_i ++)       // 渡された桁数回ループ
    {
        u4cp_buf[s4_i] = s4_val / s4_filter;      // 最上位桁の値だけを抽出(小数点以下切捨)
        s4_val %= s4_filter;                      // 最上位桁を削除(次回ループは次の桁が最上位)
        s4_filter /= 10;                          // フィルタの桁もひとつ減らす
    }
}
