//============================================================================================
// Application : BLOCK BREAK PRO-68KZ
// Platform    : SHARP X68000 / Human68k
// Build       : GCC真里子版(ver1.42) + XCライブラリ + Z-MUSIC(v2.00)
//--------------------------------------------------------------------------------------------
// Filename    : dr_com.c
// Version     : 2.0.0
// Author      : SEN::DAC
// Description : 描画リソース(GR, TX, SP/BG)共通処理
//============================================================================================
//--------------------------------------------------------------------------------------------
// インクルードファイル
//--------------------------------------------------------------------------------------------
#include <stdio.h>
#include "../type.h"
#include "../iomap.h"
#include "../crt/crt.h"
#include "dr_com.h"

//--------------------------------------------------------------------------------------------
// 定数定義 (内部用)
//--------------------------------------------------------------------------------------------
// 16色BMPファイル ヘッダー部の構造
#define BMP16HDR_TOP        0                    // ヘッダ先頭
#define BMP16HDR_FSIZE_OFS  (BMP16HDR_TOP + 2)   // ファイルサイズ
#define BMP16HDR_IMG_W_OFS  (BMP16HDR_TOP + 18)  // 画像の横幅
#define BMP16HDR_IMG_H_OFS  (BMP16HDR_TOP + 22)  // 画像の縦幅
#define BMP16HDR_PALTOP_OFS (BMP16HDR_TOP + 54)  // パレット先頭
#define BMP16HDR_IMGTOP_OFS (BMP16HDR_TOP + 118) // 画像データ先頭

// パレット種別テーブル最大数
#define DR_PAL_TYPE_MAX     2

//--------------------------------------------------------------------------------------------
// 型定義 (内部用)
//--------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------
// プロトタイプ宣言 (static)
//--------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------
// グローバル変数定義 (外部公開)
//--------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------
// 静的変数定義 (static)
//--------------------------------------------------------------------------------------------
// BMPロード用バッファ(1ニブルが1ドットなのでサイズ半分)
static U1 u1a_s_DrBmpBuf[(CRT_W * CRT_H) / 2];

// 画像変換用バッファ(GR画面は1dot=2byteで画像サイズ分必要)
static U2 u2a_s_DrCnvBuf[CRT_W * CRT_H];

// パレット種別
static volatile U2* const u2cpa_s_DrPalTbl[DR_PAL_TYPE_MAX] =
{
    &U2_VDCTR_GPL, // グラフィック画面のパレット先頭アドレス (PB0～15)
    &U2_VDCTR_PPL, // テキスト画面(PB0) / PCG(PB1～15)のパレット先頭アドレス
};

//--------------------------------------------------------------------------------------------
// 関数定義
//--------------------------------------------------------------------------------------------
//============================================================================================
// 16色 BMP からパレットをロード (グラフィックパレット(16色) / テキストパレット 共通)
//--------------------------------------------------------------------------------------------
// Arguments : const char* const szcpc_filename : (I) ロードするBMPファイル名
//             U2* const         u2cp_dstpal    : (O) パレットデータを書き込むアドレス
//             U2                u2_bright      : (I) 輝度 0:透明有効 / 1:透明無効
// Return    : BL                bl_ret         : (O) TRUE  : 成功
//                                                    FALSE : 失敗
//--------------------------------------------------------------------------------------------
// Note      ：
// BGで透明色を扱う方法 (XM6 TypeG, X68000 Zにて動作確認済み)
// パレット内で透明扱いにしたい色番号のRGB値を全て'0'(黒)かつ末尾1ビットの輝度も'0'にする。
// 輝度が'1'だと透過しない。
// 全て'0'(黒)ではない色の輝度を'0'にしても今のところ影響が見当たらない。
// パレットブロックは何番でも可能。
// 黒色を使いたい場合、RGB値を0ではなく限りなく黒に近い色にする方法もある。
// (15bitカラー化するので8以上の値であること)
//============================================================================================
BL blf_g_DrLoadPal16(const char* const szcpc_filename, U2* const u2cp_dstpal, U2 u2_bright)
{
    S4 s4_i;
    U1 u1_b = 0;
    U1 u1_g = 0;
    U1 u1_r = 0;
    U1 u1_n = 0;
    BL bl_ret = FALSE;

    FILE* fp = fopen(szcpc_filename, "rb");
    if(fp != NULL)
    {
        fseek(fp, BMP16HDR_PALTOP_OFS, SEEK_SET);
        for(s4_i = 0; s4_i < DR_COL16; s4_i ++)
        {
            fread(&u1_b, sizeof(U1), 1, fp);
            fread(&u1_g, sizeof(U1), 1, fp);
            fread(&u1_r, sizeof(U1), 1, fp);
            fread(&u1_n, sizeof(U1), 1, fp);     // リザーブ(fpを進めたいだけ)

            // 15bitカラー化(8bit→5bit)
            u1_b /= 8;
            u1_g /= 8;
            u1_r /= 8;

            // 格納 (計:16bit)
            u2cp_dstpal[s4_i] =  (U2)0;          // 一度クリアする
            u2cp_dstpal[s4_i] |= (U2)u1_g << 11; // 緑
            u2cp_dstpal[s4_i] |= (U2)u1_r << 6;  // 赤
            u2cp_dstpal[s4_i] |= (U2)u1_b << 1;  // 青
            u2cp_dstpal[s4_i] |= u2_bright;      // 輝度(1にするとBGの透明色が効かなくなる)
        }
        fclose( fp );
        bl_ret = TRUE;                           // ロード成功
    }

    return bl_ret;
}

//============================================================================================
// 16色 パレット登録 (グラフィックパレット(16色) / PCGパレット / テキストパレット 共通)
//--------------------------------------------------------------------------------------------
// Arguments : U1              u1_ptype  : (I) 登録先パレット種別 (0/1)
//             U1              u1_pb     : (I) パレットブロック   (0～15)
//             const U2* const u2cpc_src : (I) 登録するパレットデータのアドレス
// Return    : -
//============================================================================================
VD vdf_g_DrSetPal16(U1 u1_ptype, U1 u1_pb, const U2* const u2cpc_src)
{
    S4 s4_i;
    volatile U2* u2p_pal = u2cpa_s_DrPalTbl[u1_ptype & 0x01]; // パレット種別毎のアドレスを取得

    u1_pb &= (DR_COL16 - 1);                                  // PB:0～15

    for(s4_i = 0; s4_i < DR_COL16; s4_i ++)
    {
        u2p_pal[(u1_pb * DR_COL16) + s4_i] = u2cpc_src[s4_i];
    }
}

//============================================================================================
// 16色 BMP から画像をロード
// グラフィック画面(16色モード), PCG, テキスト画面 全ての描画リソースの共通処理
//--------------------------------------------------------------------------------------------
// Arguments : const char* const szcpc_filename : (I) ロードするBMPファイル名
//             U1* const         u1cp_dstbuff   : (O) ロードした画像の出力先バッファ
// Return    : BL                bl_ret         : (O) TRUE  : 成功
//                                                    FALSE : 失敗
//============================================================================================
BL blf_g_DrLoadBmp16(const char* const szcpc_filename, U1* const u1cp_dstbuff)
{
    S4 s4_i;
    U4 u4_w = 0;          // エンディアン変換後の画像の横幅
    U4 u4_h = 0;          // エンディアン変換後の画像の立幅
    U1 u1a_size[4] = {0}; // エンディアン変換用
    BL bl_ret = FALSE;    // 戻り値格納用

    FILE* fp = fopen(szcpc_filename, "rb");
    if(fp != NULL)
    {
        // 16色BMPファイルのヘッダ情報(リトルエンディアン)から画像サイズを取得
        // 68000系は(ビッグエンディアン)であるため、4バイトの情報を読み出して並び替える

        // 横幅を取得 → エンディアン変換
        fseek(fp, BMP16HDR_IMG_W_OFS, SEEK_SET);
        fread(u1a_size, sizeof(U1), 4, fp);
        u4_w |= (U4)u1a_size[3] << 24;
        u4_w |= (U4)u1a_size[2] << 16;
        u4_w |= (U4)u1a_size[1] << 8;
        u4_w |= (U4)u1a_size[0] << 0;

        // 縦幅を取得 → エンディアン変換
        fseek(fp, BMP16HDR_IMG_H_OFS, SEEK_SET);
        fread(u1a_size, sizeof(U1), 4, fp);
        u4_h |= (U4)u1a_size[3] << 24;
        u4_h |= (U4)u1a_size[2] << 16;
        u4_h |= (U4)u1a_size[1] << 8;
        u4_h |= (U4)u1a_size[0] << 0;

        // ファイルのデータ部ロードと同時に上下反転 (BMP画像データは上下が反転しているため)
        fseek(fp, BMP16HDR_IMGTOP_OFS, SEEK_SET);
        for (s4_i = u4_h - 1; s4_i >= 0; s4_i --)
        {
            fread(u1cp_dstbuff + u4_w / 2 * s4_i, sizeof(U1), u4_w / 2, fp);
        }
        fclose(fp);
        bl_ret = TRUE;    // ロード成功
    }

    return bl_ret;
}

//============================================================================================
// BMPロード用バッファのポインタを返す
//--------------------------------------------------------------------------------------------
// Arguments : -
// Return    : U1* const u1a_s_DrBmpBuf : (O) BMPロード用バッファの先頭アドレス
//============================================================================================
U1* const u1cpf_g_DrGetBmpBuf(VD)
{
    return u1a_s_DrBmpBuf;
}

//============================================================================================
// 画像変換用バッファのポインタを返す
//--------------------------------------------------------------------------------------------
// Arguments : -
// Return    : U2* const u2a_s_DrCnvBuf : (O) 画像変換用バッファの先頭アドレス
//============================================================================================
U2* const u2cpf_g_DrGetCnvBuf(VD)
{
    return u2a_s_DrCnvBuf;
}

//============================================================================================
// 各描画リソース(GR/TX/SPBG)間の表示優先順位を指定
//--------------------------------------------------------------------------------------------
// Arguments : U2 u2_1st : (I) 最前面に表示する描画リソース
//             U2 u2_2nd : (I) 中間に表示する描画リソース
//             U2 u2_3rd : (I) 最背面に表示する描画リソース
// Return    : -
//--------------------------------------------------------------------------------------------
// Note      : 
// 引数(u2_1st～u2_3rd)は、全て以下のマクロでの入力が必須となる。
// DR_PRI_GR    // グラフィック面
// DR_PRI_TX    // テキスト面
// DR_PRI_SP    // スプライト & BG面
//============================================================================================
VD vdf_g_DrSurfacePri(U2 u2_1st, U2 u2_2nd, U2 u2_3rd)
{
    U2 u2_set = U2_VDCTR_R01;           // 現在のレジスタ値を一旦受け取る

    u2_set &= 0x00FF;                   // 下位バイトはGR間の優先度なので残す
    u2_set |= (((U2)0) << u2_1st);      // 優先度 1位(b00)を指定箇所にシフト
    u2_set |= (((U2)1) << u2_2nd);      // 優先度 2位(b01)を指定箇所にシフト
    u2_set |= (((U2)2) << u2_3rd);      // 優先度 3位(b10)を指定箇所にシフト
    U2_VDCTR_R01 = u2_set;              // 値の加工が終わってからレジスタに書き戻す
}
