//============================================================================================
// Application : BLOCK BREAK PRO-68KZ
// Platform    : SHARP X68000 / Human68k
// Build       : GCC真里子版(ver1.42) + XCライブラリ + Z-MUSIC(v2.00)
//--------------------------------------------------------------------------------------------
// Filename    : dr_com.h
// Version     : 2.0.0
// Author      : SEN::DAC
// Description : 描画リソース(GR, TX, SP/BG)共通処理
//============================================================================================
//--------------------------------------------------------------------------------------------
// 2重インクルード防止
//--------------------------------------------------------------------------------------------
#ifndef _DR_COM_H_
#define _DR_COM_H_

//--------------------------------------------------------------------------------------------
// インクルードファイル
//--------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------
// 定数定義
//--------------------------------------------------------------------------------------------
// blf_g_DrLoadPal16()のパラメータ
#define BRIGHT_OFF 0  // 輝度：0
#define BRIGHT_ON  1  // 輝度：1

// vdf_g_DrSetPal16()のパラメータ：パレット種別
#define DR_PAL_GRA 0  // グラフィック用パレット ：PB:0のみ (16色モード前提)
#define DR_PAL_TXT 1  // テキスト用パレット     ：PB:0のみ (PCGパレットと共用)
#define DR_PAL_PCG 1  // PCG(SP&BG)用パレット   ：PB:1～15

// vdf_g_DrSurfacePri()のパラメータ：表示優先度
#define DR_PRI_GR  8  // グラフィック面
#define DR_PRI_TX  10 // テキスト面
#define DR_PRI_SP  12 // スプライト & BG面

// 色数
#define DR_COL16   16 // 16色

//--------------------------------------------------------------------------------------------
// 型定義
//--------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------
// extern
//--------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------
// プロトタイプ宣言
//--------------------------------------------------------------------------------------------
BL blf_g_DrLoadPal16(const char* const szcpc_filename,        // 16色BMPからパレットをロード
                     U2* const u2cp_dstpal,
                     U2 u2_bright);

VD vdf_g_DrSetPal16(U1 u1_ptype,                              // 16色パレット登録
                    U1 u1_pb,
                    const U2* const u2cpc_src);

BL blf_g_DrLoadBmp16(const char* const szcpc_filename,        // 16色BMPから画像をロード
                     U1* const u1cp_dstbuff);

U1* const u1cpf_g_DrGetBmpBuf(VD);                            // BMPロード用バッファ取得
U2* const u2cpf_g_DrGetCnvBuf(VD);                            // 画像変換用バッファ取得

VD vdf_g_DrSurfacePri(U2 u2_1st, U2 u2_2nd, U2 u2_3rd);       // 描画リソース間優先順位指定

#endif // _DR_COM_H_
