//============================================================================================
// Application : BLOCK BREAK PRO-68KZ
// Platform    : SHARP X68000 / Human68k
// Build       : GCC真里子版(ver1.42) + XCライブラリ + Z-MUSIC(v2.00)
//--------------------------------------------------------------------------------------------
// Filename    : dr_gr.c
// Version     : 2.0.0
// Author      : SEN::DAC
// Description : グラフィック画面(GR)に関する処理
//============================================================================================
//--------------------------------------------------------------------------------------------
// インクルードファイル
//--------------------------------------------------------------------------------------------
#include <stdio.h>
#include "../type.h"
#include "../iomap.h"
#include "../dma/dma.h"
#include "dr_com.h"
#include "dr_gr.h"

//--------------------------------------------------------------------------------------------
// 定数定義 (内部用)
//--------------------------------------------------------------------------------------------
// グラフィック画面の横1ラインの"ドット数"
// 特殊解像度で横384ドットの場合、画面外と合わせて横は512ドットある。
#define GR_XLINE_DOTS    512

//--------------------------------------------------------------------------------------------
// 型定義 (内部用)
//--------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------
// プロトタイプ宣言 (static)
//--------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------
// グローバル変数定義 (外部公開)
//--------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------
// 静的変数定義 (static)
//--------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------
// 関数定義
//--------------------------------------------------------------------------------------------
//============================================================================================
// 画像データ変換 (BMP配列 → GR配列)
//--------------------------------------------------------------------------------------------
// Arguments : U2* const u2cp_dstbuff : (O) 変換後データ(GR配列)格納バッファの先頭アドレス
//             U1* const u1cp_srcbuff : (I) 変換前データ(BMP配列)格納バッファの先頭アドレス
//             U2        u2_w         : (I) 画像の横幅
//             U2        u2_h         : (I) 画像の縦幅
// Return    : -
//============================================================================================
VD vdf_g_GrBmpToGr(U2* const u2cp_dstbuff, U1* const u1cp_srcbuff, U2 u2_w, U2 u2_h)
{
    U2 u2_x, u2_y;
    U4 u4_index = 0;

    for(u2_y = 0; u2_y < u2_h; u2_y ++)
    {
        // BMPファイルは 1バイトが 2ドット( 1ニブルが 1ドット)なので 2ドット分まとめて処理
        for(u2_x = 0; u2_x < u2_w; u2_x += 2 )
        {
            // +0 位置に上位ニブルを格納
            u2cp_dstbuff[u2_y * u2_w + u2_x + 0] = (U2)u1cp_srcbuff[u4_index] >> 4;

            // +1 位置に下位ニブルを格納
            u2cp_dstbuff[u2_y * u2_w + u2_x + 1] = (U2)u1cp_srcbuff[u4_index] & 0x0F;

            u4_index ++;
        }
    }
}

//============================================================================================
// グラフィック画面に画像を書き込む
//--------------------------------------------------------------------------------------------
// Arguments : const U2* const u2cpc_srcbuff : (I) 画像データ先頭アドレス
//             U4              u4_page       : (I) 書き込むGRページ番号(0～3)
//             U2              u2_w          : (I) 画像の横幅
//             U2              u2_h          : (I) 画像の縦幅
// Return    : -
//--------------------------------------------------------------------------------------------
// Note      :
// 画像データは、vdf_g_GrBmpToGr()で生成された物のフォーマットである事を前提とする。
//============================================================================================
VD vdf_g_GrDraw(const U2* const u2cpc_srcbuff, U4 u4_page, U2 u2_w, U2 u2_h)
{
    U2  u2_y;                             // ループカウンタ(画像の縦幅がループ回数となる)
    U2* u2cp_page = (U2*)(&U2_VRAM_GRA0); // 基準:ページ0のアドレス(キャストでvolatileを無効化)

    u4_page &= 0x00000003;                // ガード処理(GR画面のページは0～3であるため)
    u2cp_page += (u4_page * 0x40000);     // ページ間アドレス間隔:0x80000～2バイト演算で半分

    for(u2_y = 0; u2_y < u2_h; u2_y ++)   // X方向のDMA転送をY回行う(それでもDMAの方が速い)
    {
        vdf_g_DmaInit(u2cpc_srcbuff + (u2_y * u2_w),      // 転送元アドレス
                      u2cp_page + (u2_y * GR_XLINE_DOTS), // 転送先アドレス
                      DMA_ADDR_INC,       // 転送毎のアドレス増減設定(転送元)
                      DMA_ADDR_INC,       // 転送毎のアドレス増減設定(転送先)
                      DMA_DSP16,          // デバイスポートサイズ
                      DMA_SIZE4,          // 転送サイズ
                      u2_w / 2);          // 1ドット2バイトなので4バイト転送なら転送回数は半分

        vdf_g_DmaStart();                 // DMA転送開始
        blf_g_DmaWaitCmp();               // DMA転送完了待ち
        vdf_g_DmaClearFlag();             // DMAフラグクリア
    }
}

//============================================================================================
// グラフィック(GR)画面ページ間の表示優先度変更
//--------------------------------------------------------------------------------------------
// Arguments : U2 u2_1st : (I) GR画面ページ番号(0～3) : 表示プライオリティ 1 (最前面)
//             U2 u2_2nd : (I) GR画面ページ番号(0～3) : 表示プライオリティ 2
//             U2 u2_3rd : (I) GR画面ページ番号(0～3) : 表示プライオリティ 3
//             U2 u2_4th : (I) GR画面ページ番号(0～3) : 表示プライオリティ 4 (最背面)
// Return    : -
//============================================================================================
VD vdf_g_GrPagePri(U2 u2_1st, U2 u2_2nd, U2 u2_3rd, U2 u2_4th)
{
    U2 u2_set = U2_VDCTR_R01;           // 現在のレジスタ値を一旦受け取る

    // 下位バイト(GRページ間優先度)のみをクリアし、上位バイトの描画リソース間の優先度を保持
    u2_set &= 0xFF00;

    // 各引数を2bit(0-3)にマスクし、指定の位置に配置
    u2_set |= ((u2_1st & 0x0003) << 0);  // GRページ 優先度 1位(GP0)
    u2_set |= ((u2_2nd & 0x0003) << 2);  // GRページ 優先度 2位(GP1)
    u2_set |= ((u2_3rd & 0x0003) << 4);  // GRページ 優先度 3位(GP2)
    u2_set |= ((u2_4th & 0x0003) << 6);  // GRページ 優先度 4位(GP3)

    U2_VDCTR_R01 = u2_set;               // 値の加工が終わってからレジスタに書き戻す
}
