//============================================================================================
// Application : BLOCK BREAK PRO-68KZ
// Platform    : SHARP X68000 / Human68k
// Build       : GCC真里子版(ver1.42) + XCライブラリ + Z-MUSIC(v2.00)
//--------------------------------------------------------------------------------------------
// Filename    : dr_sp.h
// Version     : 2.0.0
// Author      : SEN::DAC
// Description : スプライト面(SP)とBG面(BG)に関する処理
//============================================================================================
//--------------------------------------------------------------------------------------------
// 2重インクルード防止
//--------------------------------------------------------------------------------------------
#ifndef _DR_SP_H_
#define _DR_SP_H_

//--------------------------------------------------------------------------------------------
// インクルードファイル
//--------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------
// 定数定義
//--------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------
// ■ パレット番号(PB：パレットブロック) [0～15] (設定によらず枚数固定)
//--------------------------------------------------------------------------------------------
// テキスト画面/SP/BG用のPB(0xE82200～)でありグラフィック用パレット(0xE82000～)とは異なる領域。
// ハードウェア仕様上、テキスト画面用パレットはPB0のみに固定されている点に注意すること。
// (SP/BGでもPB0は指定可能だが、テキスト画面の配色に影響を与える)
//--------------------------------------------------------------------------------------------
#define PB_TXT_00          0   // テキスト画面用 (物理ブロック 0)
#define PB_PCG_00          0   // PCG用 (物理ブロック 0) ※：テキスト画面用と共通
#define PB_PCG_01          1   // PCG用 (物理ブロック 1)
#define PB_PCG_02          2   // PCG用 (物理ブロック 2)
#define PB_PCG_03          3   // PCG用 (物理ブロック 3)
#define PB_PCG_04          4   // PCG用 (物理ブロック 4)
#define PB_PCG_05          5   // PCG用 (物理ブロック 5)
#define PB_PCG_06          6   // PCG用 (物理ブロック 6)
#define PB_PCG_07          7   // PCG用 (物理ブロック 7)
#define PB_PCG_08          8   // PCG用 (物理ブロック 8)
#define PB_PCG_09          9   // PCG用 (物理ブロック 9)
#define PB_PCG_10          10  // PCG用 (物理ブロック 10)
#define PB_PCG_11          11  // PCG用 (物理ブロック 11)
#define PB_PCG_12          12  // PCG用 (物理ブロック 12)
#define PB_PCG_13          13  // PCG用 (物理ブロック 13)
#define PB_PCG_14          14  // PCG用 (物理ブロック 14)
#define PB_PCG_15          15  // PCG用 (物理ブロック 15)

//--------------------------------------------------------------------------------------------
// ■ スプライト画像サイズ
//--------------------------------------------------------------------------------------------
#define SP_WIDTH8          8   // SP 1枚の表示横幅(8)
#define SP_HEIGHT8         8   // SP 1枚の表示立幅(8)
#define SP_WIDTH16         16  // SP 1枚の表示横幅(16)
#define SP_HEIGHT16        16  // SP 1枚の表示立幅(16)

//--------------------------------------------------------------------------------------------
// ■ その他
//--------------------------------------------------------------------------------------------
// BMP → PCG変換 U4型で必要な配列要素数
#define PCG_TILE_SIZE_32U4 32  // 1タイル分(16*16) 1ドット = 1ニブル → 計128バイト

// SP_DEFCG()のパラメータ
#define SP_SIZE8           0   // サイズ： 8 * 8
#define SP_SIZE16          1   // サイズ：16 * 16

// vdf_g_SpRegst() / u2f_g_SpMkPtc()のパラメータ
#define SP_V_INV_OFF       0   // V-垂直反転：OFF
#define SP_V_INV_ON        1   // V-垂直反転：ON
#define SP_H_INV_OFF       0   // H-水平反転：OFF
#define SP_H_INV_ON        1   // H-水平反転：ON

// vdf_g_SpRegst() / vdf_g_SpBgSet()のパラメータ
#define SP_PRW_HIDE        0   // 描画優先度：SP/BGを表示しない
#define SP_PRW_BG0_BG1_SP  1   // 描画優先度：(上) BG0 > BG1 > SP  (下)
#define SP_PRW_BG0_SP_BG1  2   // 描画優先度：(上) BG0 >  SP > BG1 (下)
#define SP_PRW_SP_BG0_BG1  3   // 描画優先度：(上) SP  > BG0 > BG1 (下)

// vdf_g_SpBg0Txsel() / vdf_g_SpBg1Txsel() / vdf_g_SpBgSet()のパラメータ
#define SP_BG_AR0          0   // BGデータエリア選択：エリア 0
#define SP_BG_AR1          1   // BGデータエリア選択：エリア 1

//--------------------------------------------------------------------------------------------
// 型定義
//--------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------
// extern
//--------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------
// プロトタイプ宣言
//--------------------------------------------------------------------------------------------
VD vdf_g_SpBmpToPcg(U4* const u4cp_dstpcg,                 // BMP → PCG 変換
                    const U4* const u4cpc_srcbmp);
VD vdf_g_SpFastOn(VD);                                     // PCG&REG高速アクセスON  (非表示)
VD vdf_g_SpFastOff(VD);                                    // PCG&REG高速アクセスOFF (表示)
VD vdf_g_SpHide(U1 u1_pl);                                 // スプライト消去
VD vdf_g_SpRegst(U1 u1_pl,                                 // スプライト描画
                 S2 s2_x,
                 S2 s2_y,
                 U1 u1_v,
                 U1 u1_h,
                 U1 u1_pb,
                 U1 u1_pcg,
                 U1 u1_prw);
VD vdf_g_SpBg0dispOn(VD);                                  // BG0 表示 ON
VD vdf_g_SpBg0dispOff(VD);                                 // BG0 表示 OFF
VD vdf_g_SpBg0Txsel(U2 u2_txsel);                          // BG0 データエリア指定 (0/1)
VD vdf_g_SpBg1dispOn(VD);                                  // BG1 表示 ON
VD vdf_g_SpBg1dispOff(VD);                                 // BG1 表示 OFF
VD vdf_g_SpBg1Txsel(U2 u2_txsel);                          // BG1 データエリア指定 (0/1)
U2 u2f_g_SpMkPtc(U1 u1_v, U1 u1_h, U1 u1_pb, U1 u1_pcg);   // パターンコード生成
VD vdf_g_SpBgSet(U1 u1_area, U2 u2_x, U2 u2_y, U2 u2_ptc); // BG書込み (消去の場合：ptc=0)


#endif // _DR_SP_H_
