//============================================================================================
// Application : BLOCK BREAK PRO-68KZ
// Platform    : SHARP X68000 / Human68k
// Build       : GCC真里子版(ver1.42) + XCライブラリ + Z-MUSIC(v2.00)
//--------------------------------------------------------------------------------------------
// Filename    : dr_tx.c
// Version     : 2.0.0
// Author      : SEN::DAC
// Description : テキスト画面(TX)に関する処理
//============================================================================================
#include <stdio.h>
#include "../type.h"
#include "../iomap.h"
#include "../dma/dma.h"
#include "dr_com.h"
#include "dr_tx.h"

//--------------------------------------------------------------------------------------------
// インクルードファイル
//--------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------
// 定数定義 (内部用)
//--------------------------------------------------------------------------------------------
#define TX_DOTS_W    1024                   // 画面の横幅(ドット) どの画面モードでも常に1024
#define TX_DOTS_H    1024                   // 画面の縦幅(ドット）どの画面モードでも常に1024
#define TX_XLINE_U2S 64                     // 横のU2要素数 1024ドット/U2アクセス(16bit)=64個

// DMA関数群との型一致のため外部キャストでvolatile属性を意図的に解除
#define TXT0_ADDR    ((U2*)(&U2_VRAM_TXT0)) // T0(bit:0) 先頭アドレス
#define TXT1_ADDR    ((U2*)(&U2_VRAM_TXT1)) // T1(bit:1) 先頭アドレス
#define TXT2_ADDR    ((U2*)(&U2_VRAM_TXT2)) // T2(bit:2) 先頭アドレス
#define TXT3_ADDR    ((U2*)(&U2_VRAM_TXT3)) // T3(bit:3) 先頭アドレス

//--------------------------------------------------------------------------------------------
// 型定義 (内部用)
//--------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------
// プロトタイプ宣言 (static)
//--------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------
// グローバル変数定義 (外部公開)
//--------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------
// 静的変数定義 (static)
//--------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------
// 関数定義
//--------------------------------------------------------------------------------------------
//============================================================================================
// テキストパレットにデフォルト値を設定する
//--------------------------------------------------------------------------------------------
// Arguments : -
// Return    : -
//--------------------------------------------------------------------------------------------
// Note      :
// 任意のパレットデータをテキスト画面に設定する場合は以下のようにする。
// グラフィック画面とは異なり、色番号0番がオール0(黒色)でなければ背景が透過されない。
// vdf_g_DrSetPal16(DR_PAL_TXT, PB_TXT_TEXT, u2a_pal);
//============================================================================================
VD vdf_g_TxSetDefPal(VD)
{
    S4 s4_i;
    volatile U2* const u2cp_pal = &U2_VDCTR_TPL; // テキストパレット先頭アドレス(PB0のみ)

    const U2 u2ac_defpal[DR_COL16] =             // テキストパレット(16色)デフォルト値
    {
        0x0000, 0xF83E, 0xFFC0, 0xFFFE,
        0xDE6C, 0xDE6C, 0xDE6C, 0xDE6C,
        0x4022, 0x4022, 0x4022, 0x4022,
        0x4022, 0x4022, 0x4022, 0x4022,
    };

    for(s4_i = 0; s4_i < DR_COL16; s4_i ++)
    {
        u2cp_pal[s4_i] = u2ac_defpal[s4_i];
    }
}

//============================================================================================
// テキスト画面同時書き込み機能 (1ドット：4bit)
//--------------------------------------------------------------------------------------------
// Arguments : U2 u2_x    : (I) 書き込み開始位置のX座標
//             U2 u2_y    : (I) 書き込み開始位置のY座標
//             U1 u1_data : (I) 書き込むデータ(1ドット分4ビット：0x00～0x0F)
// Return    : -
//--------------------------------------------------------------------------------------------
// Note      :
// テキスト画面のサイズは常に 1024*1024
// テキスト画面の同時書込み機能についてはInside X68000 P.206 図...29 を参照。
//============================================================================================
VD vdf_g_TxComWrite(U2 u2_x, U2 u2_y, U1 u1_data)
{
    // 書き込み対象のX方向要素数
    U2 u2_x_index = u2_x / (sizeof(U2) * 8);

    // 書き込み対象ビット位置までの右シフト数
    U2 u2_r_shift = u2_x - (sizeof(U2) * 8 * u2_x_index);

    // bit9：マスクON  bit8：同時アクセスON
    U2 func_on = 0x0300;

    // 書き込み対象ビット以外をマスクする
    // マスクパタン(0のビットだけが変更される:R21のb8が0の場合はマスクされない)
    U2_CRTC_R23 = ~(0x8000 >> u2_r_shift);

    // アクセスページ選択 (全プレーン有効)
    U2_CRTC_R21 = (0x000F << 4) | func_on;

    // プレーン4枚に対して同時書き込み (一度オール'0'でクリアする)
    TXT0_ADDR[u2_y * TX_XLINE_U2S + u2_x_index] = 0x0000;

    // アクセスページ選択 
    // このアクセスページ選択が1ドットの書込み色データであり、次のオール1書込みに対するマスク
    U2_CRTC_R21 = ((u1_data & 0x0F) << 4) | func_on;

    // プレーン4枚同時書き込みを行う (オール'1'を書き込むと有効ビットだけが反映される)
    TXT0_ADDR[u2_y * TX_XLINE_U2S + u2_x_index] = 0xFFFF;
}

//============================================================================================
// テキスト画面同時書き込み機能 OFF
//--------------------------------------------------------------------------------------------
// Arguments : -
// Return    : -
//============================================================================================
VD vdf_g_TxComOff(VD)
{
    U2_CRTC_R21 = 0; // bit9：マスクOFF  bit8：同時アクセスOFF
}

//============================================================================================
// テキスト画面に画像を描画 (同時書き込み版)
//--------------------------------------------------------------------------------------------
// Arguments : const U1* const u1cpc_srcbuf : (I) 画像データ先頭アドレス
//             U2              u2_w         : (I) 画像の横幅
//             U2              u2_h         : (I) 画像の縦幅
// Return    : -
//--------------------------------------------------------------------------------------------
// Note      :
// 384*256の画像では、グラフィック画面直書きと同程度の速度。
// DMA転送の方が高速か？
//
// 画像データは、blf_g_DrLoadBmp16()で生成された物のフォーマットである事を前提とする。
//============================================================================================
VD vdf_g_TxDraw(const U1* const u1cpc_srcbuf, U2 u2_w, U2 u2_h)
{
    U2 u2_x, u2_y;
    U4 u4_index = 0;

    for(u2_y = 0; u2_y < u2_h; u2_y ++){
        for(u2_x = 0; u2_x < u2_w; u2_x += 2){
            vdf_g_TxComWrite(u2_x + 0, u2_y, u1cpc_srcbuf[u4_index] >> 4);
            vdf_g_TxComWrite(u2_x + 1, u2_y, u1cpc_srcbuf[u4_index] & 0x0F);
            u4_index ++;
        }
    }
    vdf_g_TxComOff();    // テキスト画面 同時書き込み機能 OFF (重要)
}

//============================================================================================
// テキスト画面 全クリア (DMA版)
//--------------------------------------------------------------------------------------------
// Arguments : -
// Return    : -
//--------------------------------------------------------------------------------------------
// Note      :
// ・現状テキスト画面クリア時はvdf_g_TxAllClr()を使用するものとし、本関数は未使用とする。
// ・使用時は同時書き込み機能をOFFにしておくこと。
// ・1024dot*1024dot*4枚/8bit=byte数=524288/4byte転送=131072回の転送が必要となる。
//   MTCは2バイトで最大転送回数が0xFFFF回となる。
//   このため、2回に分けて転送を行っているが合計131070回の転送となるため、
//   T1とT3の末尾4バイトが0クリアされていない。
//   画面表示外であるため現状はこのままとするが、今後必要があれば修正を行う。
//============================================================================================
VD vdf_g_TxAllClrDma(VD)
{
    U4 u4_dummy = 0;

    // T0とT1のクリア
    vdf_g_DmaInit(&u4_dummy,    // 転送元アドレス
                  TXT0_ADDR,    // 転送先アドレス
                  DMA_ADDR_FIX, // 転送毎のアドレス増減設定(転送元)
                  DMA_ADDR_INC, // 転送毎のアドレス増減設定(転送先)
                  DMA_DSP16,    // デバイスポートサイズ
                  DMA_SIZE4,    // 転送サイズ
                  0xFFFF);      // 転送回数
    vdf_g_DmaStart();           // DMA転送開始
    blf_g_DmaWaitCmp();         // DMA転送完了待ち
    vdf_g_DmaClearFlag();       // DMAフラグクリア

    // T2とT3のクリア
    vdf_g_DmaInit(&u4_dummy,    // 転送元アドレス
                  TXT2_ADDR,    // 転送先アドレス
                  DMA_ADDR_FIX, // 転送毎のアドレス増減設定(転送元)
                  DMA_ADDR_INC, // 転送毎のアドレス増減設定(転送先)
                  DMA_DSP16,    // デバイスポートサイズ
                  DMA_SIZE4,    // 転送サイズ
                  0xFFFF);      // 転送回数
    vdf_g_DmaStart();           // DMA転送開始
    blf_g_DmaWaitCmp();         // DMA転送完了待ち
    vdf_g_DmaClearFlag();       // DMAフラグクリア
}

//============================================================================================
// テキスト画面 全クリア (同時書き込み機能版)
//--------------------------------------------------------------------------------------------
// Arguments : -
// Return    : -
//--------------------------------------------------------------------------------------------
// Note      :
// ・現状テキスト画面クリア時はvdf_g_TxAllClr()を使用するものとし、本関数は未使用とする。
// ・テキスト画面同時書込み機能の評価用として作成。
//   現状は速度が出ていないため、今後アルゴリズムを見直す。
//============================================================================================
VD vdf_g_TxAllClrCom(VD)
{
    U2 u2_x, u2_y;

    for(u2_y = 0; u2_y < TX_DOTS_H; u2_y ++){
        for(u2_x = 0; u2_x < TX_DOTS_W; u2_x ++){
            vdf_g_TxComWrite(u2_x, u2_y, 0);
        }
    }
    vdf_g_TxComOff();    // テキスト画面 同時書き込み機能 OFF (重要)
}

//============================================================================================
// テキスト画面 全クリア
//--------------------------------------------------------------------------------------------
// Arguments : -
// Return    : -
//--------------------------------------------------------------------------------------------
// Note      :
// 使用時は同時書き込み機能をOFFにしておくこと。
//============================================================================================
VD vdf_g_TxAllClr(VD)
{
    S4 s4_i;

    for(s4_i = 0; s4_i < (TX_XLINE_U2S * TX_DOTS_H); s4_i ++)
    {
        TXT0_ADDR[s4_i] = 0;
        TXT1_ADDR[s4_i] = 0;
        TXT2_ADDR[s4_i] = 0;
        TXT3_ADDR[s4_i] = 0;
    }
}
