//============================================================================================
// Application : BLOCK BREAK PRO-68KZ
// Platform    : SHARP X68000 / Human68k
// Build       : GCC真里子版(ver1.42) + XCライブラリ + Z-MUSIC(v2.00)
//--------------------------------------------------------------------------------------------
// Filename    : input.h
// Version     : 2.0.0
// Author      : SEN::DAC
// Description : ゲーム用入力処理：キーボード(一部のキー)とジョイカードを扱う
//               押した瞬間 / 押し続け / 離した瞬間 / 離し続け のボタン状態を取得可能
//               過去DirectX7用として作成した物をベースにX68000対応(ジョイカードはZ純正を想定)
//============================================================================================
//--------------------------------------------------------------------------------------------
// 2重インクルード防止
//--------------------------------------------------------------------------------------------
#ifndef _INPUT_H_
#define _INPUT_H_

//--------------------------------------------------------------------------------------------
// インクルードファイル
//--------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------
// 定数定義
//--------------------------------------------------------------------------------------------
// コントローラID
#define CONTROLLER_1 0      // コントローラ 1P
#define CONTROLLER_2 1      // コントローラ 2P

// ボタン：キーボード & ジョイカード両対応
#define BTN_UP       0x0001 // bit00：上ボタン
#define BTN_DOWN     0x0002 // bit01：下ボタン
#define BTN_LEFT     0x0004 // bit02：左ボタン
#define BTN_RIGHT    0x0008 // bit03：右ボタン
//
#define BTN_A        0x0010 // bit04：Aボタン(環境依存:Z+純正JOYCARD想定)
#define BTN_B        0x0020 // bit05：Bボタン(環境依存:Z+純正JOYCARD想定)
#define BTN_SELECT   0x0040 // bit06：SELECTボタン(Z純正JOYCARDの追加ボタン:上下同時押し)
#define BTN_START    0x0080 // bit07：START ボタン(Z純正JOYCARDの追加ボタン:左右同時押し)

// ボタン：キーボードのみ対応 拡張ボタン (キーボード入力はコントローラ 1P 扱い)
#define BTN_C        0x0100 // bit08：Cボタン
#define BTN_D        0x0200 // bit09：Dボタン
#define BTN_E        0x0400 // bit10：Eボタン
#define BTN_F        0x0800 // bit11：Fボタン
//
#define BTN_G        0x1000 // bit12：Gボタン
#define BTN_H        0x2000 // bit13：Hボタン
#define BTN_I        0x4000 // bit14：Iボタン
#define BTN_J        0x8000 // bit15：Jボタン

// 状態
#define BS_RELEASE   1      //離している
#define BS_DOWN      2      //押した瞬間
#define BS_PRESS     3      //押し続けている
#define BS_UP        4      //離した瞬間

//--------------------------------------------------------------------------------------------
// 型定義
//--------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------
// extern
//--------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------
// プロトタイプ宣言
//--------------------------------------------------------------------------------------------
VD vdf_g_InputMakeData(VD);                                // 入力情報作成
U2 u2f_g_InputGetState(U2 u2_id, U2 u2_btn, U2 u2_state ); // 入力情報取得

#endif // _INPUT_H_
