//============================================================================================
// Application : BLOCK BREAK PRO-68KZ
// Platform    : SHARP X68000 / Human68k
// Build       : GCC真里子版(ver1.42) + XCライブラリ + Z-MUSIC(v2.00)
//--------------------------------------------------------------------------------------------
// Filename    : sResult.c
// Version     : 2.0.0
// Author      : SEN::DAC
// Description : シーン[リザルト]
//============================================================================================
//--------------------------------------------------------------------------------------------
// インクルードファイル
//--------------------------------------------------------------------------------------------
#include "sResult.h"

//--------------------------------------------------------------------------------------------
// 定数定義 (内部用)
//--------------------------------------------------------------------------------------------
#define SCORE_POS_X      168            // スコア表示 X座標
#define SCORE_POS_Y      128            // スコア表示 Y座標

#define WAIT_TIME_RESULT 2000           // リザルト表示のウェイト時間(ms単位：2秒)
#define WAIT_TIME_ENTER  2000           // ボタン押下時のウェイト時間(ms単位：2秒)

//--------------------------------------------------------------------------------------------
// 型定義 (内部用)
//--------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------
// プロトタイプ宣言 (static)
//--------------------------------------------------------------------------------------------
static VD vdf_s_sResultRun(VD);         // シーンの実行
static VD vdf_s_sResultRelease(VD);     // シーンの解放

//--------------------------------------------------------------------------------------------
// グローバル変数定義 (外部公開)
//--------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------
// 静的変数定義 (static)
//--------------------------------------------------------------------------------------------
static U2 u2a_s_sResultGrPal[DR_COL16]; // リザルト背景のパレット(16色)

//--------------------------------------------------------------------------------------------
// 関数定義
//--------------------------------------------------------------------------------------------
//============================================================================================
// シーン[リザルト]：シーン内で使用する画像を全てロード
//--------------------------------------------------------------------------------------------
// Arguments : -
// Return    : BL : (O) TRUE  : 成功
//                      FALSE : 失敗
//============================================================================================
BL blf_g_sResultLoadImage(VD)
{
    U1* const u1cp_bbuf = u1cpf_g_DrGetBmpBuf();               // BMPロード用バッファ取得
    U2* const u2cp_cbuf = u2cpf_g_DrGetCnvBuf();               // 画像変換用バッファ取得

    // 背景画像(GR)-16色BMP画像ロードと書込み
    if(!blf_g_DrLoadBmp16(SZ_IMGFN_BK_RESULT, u1cp_bbuf)) return FALSE;

    vdf_g_GrBmpToGr(u2cp_cbuf, u1cp_bbuf, CRT_W, CRT_H);       // BMP → GR 変換
    vdf_g_GrDraw(u2cp_cbuf, GP2, CRT_W, CRT_H);                // グラフィック画面に書き込み
    vdf_g_AppPBarAdd();                                        // プログレスバーを進める

    // 背景画像(GR)のパレットのロード(登録はシーン初期化で行う)
    if(!blf_g_DrLoadPal16(SZ_IMGFN_BK_RESULT, u2a_s_sResultGrPal, 0)) return FALSE;
    vdf_g_AppPBarAdd();                                        // プログレスバーを進める

    return TRUE;
}

//============================================================================================
// シーン[リザルト]：初期化処理
//--------------------------------------------------------------------------------------------
// Arguments : -
// Return    : -
//============================================================================================
VD vdf_g_sResultInit(VD)
{
    vdf_g_GrPagePri(GP2, GP3, GP0, GP1);                       // GRn画面プライオリティ設定
    vdf_g_DrSetPal16(DR_PAL_GRA, PB_GRA, u2a_s_sResultGrPal);  // パレット登録

    vdf_g_ObjScoreDraw(SCORE_POS_X, SCORE_POS_Y);              // スコアの描画
    m_pcmplay(SOUND_ALL_CLR, PCM_PAN_C, PCM_FR15_6KHZ);        // 効果音(全クリア)
    vdf_g_TimerWait(WAIT_TIME_RESULT);                         // 指定した時間処理を止める
    vdf_g_AppSetProc(vdf_s_sResultRun);                        // 実行に遷移
}

//============================================================================================
// シーン[リザルト]：実行処理
//--------------------------------------------------------------------------------------------
// Arguments : -
// Return    : -
//============================================================================================
static VD vdf_s_sResultRun(VD)
{
    if(u2f_g_InputGetState(CONTROLLER_1, BTN_A, BS_DOWN) ||    // Aボタンが押された または
       u2f_g_InputGetState(CONTROLLER_1, BTN_B, BS_DOWN) ||    // Bボタンが押された または
       u2f_g_InputGetState(CONTROLLER_1, BTN_START, BS_DOWN))  // STARTボタンが押された場合
    {
        m_pcmplay(SOUND_ENTER, PCM_PAN_C, PCM_FR15_6KHZ);      // 効果音(カーソル：決定)
        vdf_g_TimerWait(WAIT_TIME_ENTER);                      // 指定した時間処理を止める
        vdf_g_AppSetNext(vdf_g_sTitleInit);                    // 次のシーンを設定
        vdf_g_AppSetProc(vdf_s_sResultRelease);                // 解放に遷移
    }

    vdf_g_CrtVblank();                                         // 描画タイミング待ち

    // *** 動的なスプライト描画処理を追加する場合ここに記述する ***
}

//============================================================================================
// シーン[リザルト]：解放処理
//--------------------------------------------------------------------------------------------
// Arguments : -
// Return    : -
//============================================================================================
static VD vdf_s_sResultRelease(VD)
{
    U2 u2a_pal[DR_COL16] = {0};                                // 16色全て黒のパレット

    vdf_g_DrSetPal16(DR_PAL_GRA, PB_GRA, u2a_pal);             // 全黒パレットでGR画面を非表示
    vdf_g_ObjScoreRelease();                                   // スコアの解放
    vdf_g_AppMoveProc();                                       // 次のシーンに遷移
}
